Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: You can run something like `git log 1a410e` to look through your whole history, but you still have to remember that `1a410e` is the last commit in order to walk that history to find all those objects.
es: Puedes utilizar algo así como `git log 1a410e` para hechar un vistazo a lo largo de toda tu historia, recorriendola y encontrando todos tus objetos. Pero para ello has necesitado recordar que la última confirmación de cambios es `1a410e`.

source: This is often used if everyone on your team has access to a shared filesystem such as an NFS mount, or in the less likely case that everyone logs in to the same computer.
es: Se utiliza habitualmente cuando todos los miembros del equipo tienen acceso a un mismo sistema de archivos, como por ejemplo un punto de montaje NFS, o en los casos en que todos se conectan al mismo ordenador.

source: Now you can switch back to your work-in-progress branch on issue #53 and continue working on it (see Figure 3-15):
es: Y, con esto, ya estas dispuesto para regresar al trabajo sobre el problema #53 (ver Figura 3-15):

source: Then, John, Josie, or Jessica can push the first version of their project into that repository by adding it as a remote and pushing up a branch.
es: Y John, Josie o Jessica podrán enviar (push) la primera versión de su proyecto a dicho repositorio, añadiendolo como remoto y enviando (push) una rama (branch).

source: Insert 18333fig0703.png Figure 7-3.
es: Insert 18333fig0703.png Figura 7-3.

source: However, because no alternates are listed in this case, your object must be in a packfile.
es: Pero, en este caso, no hay altenativas. Por lo que el objeto debe encontrarse dentro de un empaquetado.

source: For example, to see a specific commit, suppose you run a `git log` command and identify the commit where you added certain functionality:
es: Por ejemplo, a la hora de localizar una confirmación de cambios, supongamos que se lanza el comando 'git log' e intentamos localizar la confirmación de cambios concreta donde se añadió una cierta funcionalidad:

source: Creating a new branch is as quick and simple as writing 41 bytes to a file (40 characters and a newline).
es: Crear una nueva rama es tan rápido y simple como escribir 41 bytes en un archivo, (40 caracteres y un retorno de carro).

source: You can also run something like `make` or `make tests` or whatever you have that runs automated tests for you.
es: También se puede emplear algo como `make` o como `make tests` o cualquier otro método que se tenga para lanzar pruebas automatizadas sobre el sistema.

source: The useful `--merged` and `--no-merged` options have been available in Git since version 1.5.6 for this purpose.
es: Para ello, Git dispone, desde la versión 1.5.6, las opciones '--merged' y '--no-merged'.

source: Because hooks aren’t transferred with a clone of a project, you must distribute these scripts some other way and then have your users copy them to their `.git/hooks` directory and make them executable.
es: Debido a que estos enganches no se transfieren junto con el clonado de un proyecto, tendrás que distribuirlos de alguna otra manera. Y luego pedir a tus usuarios que se los copien a sus carpetas '.git/hooks' y los hagan ejecutables.

source: If the maintainers merge, rebase, or cherry-pick your work, you’ll eventually get it back via pulling from their repository anyhow:
es: Si el gestor del proyecto fusiona (merge), reorganiza (rebase) o integra solo parcialmente tu trabajo, aún podrás recuperarlo de vuelta a través de su repositorio:

source: When that is committed and pushed up, your running daemon should start serving requests for the project to anyone who has access to port 9418 on your server.
es: Cuando confirmes (commit) y envies (push) estos cambios, el demonio que está en marcha en el servidor comenzará a responder a peticiones de cualquiera que solicite dicho proyecto a través del puerto 9418 de tu servidor.

source: When a topic branch has finally been merged into `master`, it’s removed from the repository.
es: Una rama puntual se borra del repositorio cuando, finalmente, es fusionada en la rama 'master'.

source: Insert 18333fig0523.png Figure 5-23.
es: Insert 18333fig0523.png Figura 5-23.

source: ## The Refspec ##
es: ## Las especificaciones para hacer referencia a... (refspec) ##

source: HEAD file pointing to the branch you’re on.
es: Apuntador HEAD a la rama donde estás actualmente.

source: If some of the changes modify the same file, try to use `git add --patch` to partially stage files (covered in detail in Chapter 6).
es: Si algunos de los cambios modifican un mismo archivo, utiliza el comando 'git add --patch' para almacenar parcialmente los archivos (tal y como se verá detalladamente en el Capítulo 6).

source: ### Object Storage ###
es: ### Almacenamiento de los objetos ###

source: Now, `gc` your database and see how much space you’re using:
es: Ahora, puedes limpiar `gc` tu base de datos y comprobar cuánto espacio estás ocupando:

source: First, the ACL file is in a different place, because this script runs from your working directory, not from your Git directory.
es: La primera es que el archivo ACL está en otra ubicación, debido a que el script corre desde tu carpeta de trabajo y no desde la carpeta de Git.

source: To pull the `master` branch on the remote down to `origin/mymaster` locally, you can run
es: Para recuperar la rama `master` del servidor remoto a tu rama `origin/mymaster` local, puedes lanzar el comando

source: Insert 18333fig0333.png Figure 3-33.
es: Insert 18333fig0333.png Figura 3-33.

source: It must run its own daemon, which is custom — we’ll look at setting one up in the “Gitosis” section of this chapter — it requires `xinetd` configuration or the like, which isn’t always a walk in the park.
es: Necesita activar su propio demonio, (tal y como se explica en la sección "Gitosis", más adelante, en este capítulo); y necesita configurar 'xinetd' o similar, lo cual no suele estar siempre disponible en el sistema donde estés trabajando.

source: This is generally good policy; but in the case of the rebase, you may determine that you know what you’re doing and can force-update the remote branch with a `-f` flag to your push command.
es: Habitualmente, este es el comportamiento más adecuado. Pero, en el caso de las reorganizaciones, cuando estás totalmente seguro de lo que haces, puedes forzar el envio, utilizando la opción '-f' en el comando 'git push' a la rama remota.

source: ## Distributed Workflows ##
es: ## Flujos de trabajo distribuidos ##

source: In addition, each of these has subsettings you can use to set specific colors for parts of the output, if you want to override each color.
es: Además, cada uno de ellos tiene parámetros adiccionales para asignar colores a partes específicas, por si quieres precisar aún más.

source: Resolving deltas: 100% (1951/1951), done.
es: Resolving deltas: 100% (1951/1951), done.Resolving deltas: 100% (1951/1951), done.

source: The maintainer pushes merged changes to the main repository.
es: La gestora envia (push) los cambios fusionados al repositorio principal.

source: You can accomplish the same task with `--tree-filter` if you want.
es: Aunque también puedes hacer lo mismo con la opción`--tree-filter`, si así lo prefieres.

source: ### Local Protocol ###
es: ### Procolo Local ###

source: Run `git push (remote) (branch)`:
es: Con el comando 'git push (remoto) (rama)':

source: Notice that you printed that out to stdout at the very beginning of your update script.
es: Precisamente, lo enviado a la salida estandar stdout justo al principio del script de actualización.

source: Looking at your Git status again, you can see that you’ve unstaged the TODO file:
es: Volviendo a mirar el estado de Git, se comprueba que se ha sacado el archivo TODO del área de preparación:

source: Furthermore, if the ref marker isn’t there in any of your commits, you’ll see the error message you’re printing out for that.
es: Es más, si la referencia (ref marker) no se encuentra presente para alguna de las confirmaciones de cambio, verás el mensaje de error previsto para ello:

source: Insert 18333fig0326.png Figure 3-26.
es: Insert 18333fig0326.png Figura 3-26.

source: John’s repository after merging origin/master.
es: El repositorio de John tras fusionar origin/master.

source: The update script is very similar to the `pre-receive` script, except that it’s run once for each branch the pusher is trying to update.
es: El punto de enganche 'update' es muy similar a 'pre-receive', pero con la diferencia de que se activa una vez por cada rama que se está intentando actualizar con el envio.

source: This resolution has a little of each section, and I’ve fully removed the `<<<<<<<`, `=======`, and `>>>>>>>` lines.
es: Esta corrección contiene un poco de ambas partes. Y se han eliminado completamente las líneas `<<<<<<<` , `=======` y `>>>>>>>`

source: In this particular case, we’re using the `/var/www/htdocs` path that is common for Apache setups, but you can use any static web server — just put the bare repository in its path.
es: En este caso particular, estamos usando el camino '/var/www/htdocs', habitual en las configuraciones de Apache. Pero puedes utilizar cualquier servidor web estático, sin más que poner el repositorio en su camino.

source: Your first challenge is to enforce that each commit message must adhere to a particular format.
es: Tu primer reto es asegurarte que todos y cada uno de los mensajes de confirmación de cambios se ajustan a un determinado formato.

source: The next type you’ll look at is the tree object, which solves the problem of storing the filename and also allows you to store a group of files together.
es: El siguiente tipo de objeto a revisar serán los objetos tipo arbol. Estos se encargan de resolver el problema de guardar un nombre de archivo, a la par que guardamos conjuntamente un grupo de archivos.

source: If you pass `--abbrev-commit` to the `git log` command, the output will use shorter values but keep them unique; it defaults to using seven characters but makes them longer if necessary to keep the SHA-1 unambiguous:
es: Con la opción '--abbrev-commit' del comando 'git log', en su salida se mostrarán valores acortados, pero únicos de SHA. Habitualmente suelen resultar valores de siete caracteres, pero alguno puede ser más largo si es necesario para preservar la unicidad de todos los valores SHA-1 mostrados:

source: If you place a `^` at the end of a reference, Git resolves it to mean the parent of that commit.
es: Colocando un '^' al final de una referencia, Git interpreta que se refiere al padre de dicha referencia.

source: Running this command gives you a list of commits in your text editor that looks something like this:
es: Al lanzar este comando, se verán una lista de confirmaciones de cambio en la pantalla del editor de textos:

source: If you can find or write a Word-to-plain-text converter that works well enough, that solution will likely be incredibly effective.
es: Si pudieras encontrar o escribir un conversor suficientemente bueno de-Word-a-texto-plano, esta solución sería terriblemente efectiva.

source: It tells you the SHA-1 of the first bad commit and show some of the commit information and which files were modified in that commit so you can figure out what happened that may have introduced this bug:
es: Git reporta el código SHA-1 de la primera confirmación de cambios problemática y muestra una parte de la información relativa a esta y a los archivos modificados en ella. Así podemos irnos haciendo una idea de lo que ha podido suceder para que se haya introducido un error en el código:

source: The really nice thing about this is that it can be repacked at any time.
es: Lo verdaderamente interesante de todo este proceso es que podemos reempaquetar en cualquier momento

source: You no longer have to manually create a bare repository for new projects on the server — Gitosis creates them automatically when it sees the first push:
es: Ya no necesitarás crear manualmente repositorios básicos vacios para los nuevos proyectos en el servidor. Gitosis se encargará de hacerlo por tí, en cuanto realices el primer envio (push) de un nuevo proyecto:

source: You may have skipped to this chapter from a previous chapter, or you may have gotten here after reading the rest of the book — in either case, this is where you’ll go over the inner workings and implementation of Git.
es: Puedes que hayas llegado a este capítulo saltando desde alguno previo o puede que hayas llegado tras leer todo el resto del libro. --En uno u otro caso, aquí es donde aprenderás acerca del funcionamiento interno y la implementación de Git--.

source: First, you choose which protocols you want your server to communicate with.
es: Lo primero, has de elegir el/los protocolo/s que deseas para comunicarte con el servidor.

source: Many larger projects have established procedures for accepting patches — you’ll need to check the specific rules for each project, because they will differ.
es: Muchos grandes proyectos suelen tener establecidos los procedimientos para aceptar parches; --es necesario que compruebes las normas específicas para cada proyecto, ya que pueden variar de uno a otro--.

source: Here, you’ll look at a few interactive commands that can help you easily craft your commits to include only certain combinations and parts of files.
es: Se van a mostrar unos pocos comandos interactivos que suelen ser de gran utilidad a la hora de recoger en una confirmación de cambios solo ciertas combinaciones y partes de archivos.

source: You do this by telling Git how to convert your binary data to a text format that can be compared via the normal diff.
es: Se consigue diciendole a Git la forma de convertir los datos binarios en texto, consiguiendo así que puedan ser comparado con la herramienta habitual de comparación textual.

source: Because the commit on the branch you’re on isn’t a direct ancestor of the branch you’re merging in, Git has to do some work.
es: Debido a que la confirmación en la rama actual no es ancestro directo de la rama que pretendes fusionar, Git tiene cierto trabajo extra que hacer.

source: If you run a `git push` and your current branch is tracking `origin/master`, the commits listed by `git log origin/master..HEAD` are the commits that will be transferred to the server.
es: Si se lanza el comando 'git push' (y la rama activa actual esta relacionada con 'origin/master'), las confirmaciones de cambio mostradas por `git log origin/master..HEAD` serán las que serán transferidas al servidor.

source: If you had run that instead, you’d have gotten back to your original position:
es: Y asi se puede conseguir volver exactamente al punto original:

source: We covered how to generate a new key earlier, in the "Simple Setups" section.
es: Veremos cómo generar una de estas claves, más adelante, en la sección "Ajustes Simples".

source: Insert 18333fig0332.png Figure 3-32.
es: Insert 18333fig0332.png Figura 3-32.

source: After all this is set, if you run diff commands such as this: $ git diff 32d1776b1^ 32d1776b1
es: Tras ajustar todo esto, si lanzas comandos tales como: $ git diff 32d1776b1 ^ 32d1776b1

source: Jessica e-mails John to tell him that she’s pushed some work into a branch named `featureA` and he can look at it now.
es: Jessica notifica a John por correo electrónico que ha enviado trabajo a una rama denominada 'featureA' y que puede hecharle un vistazo allí.

source: To demonstrate, you’ll add a large file into your test repository, remove it in the next commit, find it, and remove it permanently from the repository.
es: Para probarlo por tí mismo, puedes añadir un archivo enorme a tu repositorio de pruebas y retirarlo en la siguiente confirmación de cambios. Así podrás practicar la busqueda y borrado permanente del repositorio.

source: Insert 18333fig0319.png Figure 3-19.
es: Insert 18333fig0319.png Figura 3-19.

source: This is fine if the whole thing is source code, because Git is highly optimized to compress that data efficiently.
es: Todo suele ir bien si el contenido es únicamente código fuente. Ya que Git está tremendamente optimizado para comprimir eficientemente ese tipo de datos.

source: Insert 18333fig0510.png Figure 5-10.
es: Insert 18333fig0510.png Figura 5-10.

source: First, you can inject the SHA-1 checksum of a blob into an `$Id$` field in the file automatically.
es: La primera, es inyectando automáticamente la suma de comprobación SHA-1 de un gran objeto binario (blob) en un campo '$Id$' dentro del archivo.

source: The actual object transfer gives no output, but it does happen.
es: La copia de objetos no da ningún mensaje, pero también se realiza.

source: Checking out a local branch from a remote branch automatically creates what is called a _tracking branch_.
es: Activando (checkout) una rama local a partir de una rama remota, se crea automáticamente lo que podríamos denominar "una rama de seguimiento" (tracking branch).

source: The references won’t be the same on someone else’s copy of the repository; and right after you initially clone a repository, you'll have an empty reflog, as no activity has occurred yet in your repository.
es: Las referencias de una cierta persona en su repositorio nunca seran las mismas que las de cualquier otra persona en su copia local del repositorio. Es más, justo tras terminar de clonar un repositorio lo que se tiene es un registro de referencia vacio, puesto que aún no se ha realizado ningún trabajo sobre dicho repositorio recién clonado.

source: Insert 18333fig0526.png Figure 5-26.
es: Insert 18333fig0526.png Figura 5-26.

source: If you visit the Pricing and Signup page at `http://github.com/plans` and click the "Sign Up" button on the Free account (see figure 4-2), you’re taken to the signup page.
es: Si visitas la página de Precios e Inicio de Sesión, en 'http://github.com/plans', y clicas sobre el botón "Registro" ("Sign Up") de las cuentas gratuitas, verás una página de registro:

source: Another thing you can do for your archives is some simple keyword substitution.
es: Otra cosa que puedes realizar sobre tus archivos es algún tipo de sustitución simple de claves.

source: When you want to share that work, you merge it into your own master branch, then fetch and merge `origin/master` if it has changed, and finally push to the `master` branch on the server.
es: Cuando deseas compartir ese trabajo, lo fusionas (merge) en tu propia rama 'master'; luego recuperas (fetch) y fusionas (merge) la rama 'origin/master', por si hubiera cambiado; y finalmente envias (push) la rama 'master' de vuelta al servidor.

source: If that is different, you must set the `$user` variable manually.
es: Si no fuera así, tendrás que ajustar manualmente la variable '$user'.

source: However, if there are too many loose objects (objects not in a packfile) or too many packfiles, Git launches a full-fledged `git gc` command.
es: Pero, cuando hay demasiados objetos sueltos, (objetos fuera de un archivo empaquetador), o demasiados archivos empaquetadores, Git lanza un comando `git gc` completo.

source: It has paused the process while you resolve the conflict.
es: Sino que hace una pausa en el proceso, esperando a que tu resuelvas el conflicto.

source: You can set your merge tool to kdiff3, opendiff, tkdiff, meld, xxdiff, emerge, vimdiff, or gvimdiff.
es: Puedes utilizar kdiff3, opendiff, tkdiff, meld, xxdiff, emerge, vimdiff, o gvimdiff como herramientas de fusionado.

source: These values are specific to that single repository.
es: Estos valores se aplicarán únicamente a dicho repositorio.

source: This script uses a syntax that wasn’t covered in the Revision Selection section of Chapter 6.
es: Este script utiliza una sintaxis no contemplada en la sección de Selección de Revisiones del capítulo 6.

source: # Distributed Git #
es: # Git en entornos distribuidos #

source: If your project’s `.git` directory contains a copy of the ACL file you used previously, then the following `pre-commit` script will enforce those constraints for you:
es: Si la carpeta '.git' de tu proyecto contiene una copia del archivo de control de accesos (ACL) utilizada previamente, este script 'pre-commit' podrá comprobar los límites:

source: In any case, you can change e-mail addresses in multiple commits in a batch with `filter-branch` as well.
es: En cualquier caso, se pueden cambiar de un golpe las direcciones de correo en multiples confirmaciones de cambio.

source: You can read the value of your HEAD via this command:
es: Puedes leer el valor de HEAD a través de él:

source: You can create a new tag as I discussed in Chapter 2.
es: Puedes crear una nueva etiqueta tal y como se ha comentado en el capítulo 2.

source: At this point, she needs to share her work with John, so she pushes her `featureA` branch commits up to the server.
es: En ese punto, necesita compartir su trabajo con John, por lo que envia (push) al servidor las confirmaciones (commits) en su rama 'featureA'.

source: ### Server-Side Hooks ###
es: ### Puntos de enganche del lado servidor ###

source: Git as a content-addressable filesystem is a very powerful tool that you can easily use as more than just a VCS.
es: Git, en su calidad de sistema de archivos indexador-de-contenidos, es una herramienta muy poderosa que puedes usar facilmente para otras tareas ademas de la de gestión de versiones.

source: You set up the information in that project; and when you push it, Gitosis reconfigures the server based on that, which is cool.
es: Preparas la información en ese proyecto especial, y cuando la envias (push), Gitosis reconfigura el servidor en base a ella. ¡Realmente interesante!.

source: If it does, then it was introduced sometime before this middle commit; if it doesn’t, then the problem was introduced sometime after the middle commit.
es: Si este es el caso, el problema se introdujo en algún punto anterior a esta confirmación de cambios intermedia. Si no, el problema se introdujo en un punto posterior.

source: This object type is called a blob.
es: Este tipo de objeto se denomina un blob (binary large object).

source: You can easily check to see if you have a key already by going to that directory and listing the contents:
es: Puedes verificar si tienes ya unas claves, simplemente situandote sobre dicha carpeta y viendo su contenido:

source: One of the things you’ll want to do is create an archive of the latest snapshot of your code for those poor souls who don’t use Git.
es: Una de las cosas que desearas crear es un archivo con la más reciente imagen de tu código, para aquellas pobres almas que no utilizan Git.

source: The merge goes smoothly — John’s commit history now looks like Figure 5-5.
es: Si la fusión se realiza sin problemas, el historial de John será algo parecido a la Figura 5-5.

source: Wrap it to about 72 characters or so.
es: Limitando las líneas a 72 caracteres mas o menos.

source: The content structure of your current Git data.
es: La estructura del contenido Git para tus datos actuales.

source: Doing so offers a number of advantages: a hosting site is generally quick to set up and easy to start projects on, and no server maintenance or monitoring is involved.
es: Esta forma de trabajar tiene varias ventajas: un alberge externo suele ser rápido de configurar y sencillo de iniciar proyectos en él; además de no ser necesario preocuparte de su mantenimiento ni de su monitorización.

source: If that works well, you can fast-forward your `master` branch, and you’ll end up with a linear project history.
es: Si funciona, se realizará un avance rápido (fast-forward) en tu rama 'master', y acabarás teniendo un historial lineal en tu proyecto.

source: #### Large-Merging Workflows ####
es: #### Flujos de trabajo con grandes fusiones ####
